controllers/ArticleController.php

    protected function findModel($slug)
    {
        if (($model = Article::findOne(['slug' => $slug])) !== null) {
---
SELECT * FROM `article` WHERE `slug`='why-yii-is-excellent'