models/User.php

SELECT * FROM `user` WHERE `id`=7
---
    public static function findIdentity($id)
    {
        return self::findOne($id);